cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x7_SVD.xml
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd" >
<name>SIM3U167_B</name>
	<version>1</version>
	<description>USB, 256K Flash, 32K RAM, EMIF</description>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<size>32</size>
	<access>read-write</access>
	<peripherals>
		<peripheral>
			<name>SARADC_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>ADC</groupName>
			<baseAddress>0x4001a000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SARADC0_IRQn</name>
				<value>35</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONFIG</name>
					<description>Module Configuration</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SPSEL</name>
							<description>Sampling Phase Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>PHASE0</name>
									<description>The ADC samples at SSG phase 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE1</name>
									<description>The ADC samples at SSG phase 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE2</name>
									<description>The ADC samples at SSG phase 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE3</name>
									<description>The ADC samples at SSG phase 3.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE4</name>
									<description>The ADC samples at SSG phase 4.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE5</name>
									<description>The ADC samples at SSG phase 5.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE6</name>
									<description>The ADC samples at SSG phase 6.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE7</name>
									<description>The ADC samples at SSG phase 7.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE8</name>
									<description>The ADC samples at SSG phase 8.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE9</name>
									<description>The ADC samples at SSG phase 9.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE10</name>
									<description>The ADC samples at SSG phase 10.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE11</name>
									<description>The ADC samples at SSG phase 11.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE12</name>
									<description>The ADC samples at SSG phase 12.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE13</name>
									<description>The ADC samples at SSG phase 13.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE14</name>
									<description>The ADC samples at SSG phase 14.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PHASE15</name>
									<description>The ADC samples at SSG phase 15.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPEN</name>
							<description>Sampling Phase Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Phase Select.  The ADC will always sample on the start-of-conversion trigger selected by the SCSEL field.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Phase Select.  The ADC will sample according to the phase selected by the SPSEL field.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSGEN</name>
							<description>Synchronous Sample Generator Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the SAR clock output to SSG.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The ADC is the SSG master, and the SAR clock will be output to the SSG block.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PACKMD</name>
							<description>Output Packing Mode. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UPPER_ONLY</name>
									<description>Data is written to the upper half-word and the lower half-word is filled with 0's.  An SCI interrupt is triggered when data is written, if enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWER_ONLY</name>
									<description>Data is written to the lower half-word, and the upper half-word is filled with 0's. An SCI interrupt is triggered when data is written, if enabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPPER_FIRST</name>
									<description>Two data words are packed into the register with the upper half-word representing the earlier data, and the lower half-word representing the later data.  If SIMCEN is set to 1, the upper half-word represents data from the master ADC (selected by SSGEN) and the lower half-word represents data from the slave ADC. The ADC write to the lower half-word will trigger the SCI interrupt, if enabled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWER_FIRST</name>
									<description>Two data words are packed into the register with the lower half-word representing the earlier data, and the upper half-word representing the later data.  If SIMCEN is set to 1, the lower half-word represents data from the master ADC (selected by SSGEN) and the upper half-word represents data from the slave ADC. The ADC write to the upper half-word will trigger the SCI interrupt, if enabled.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SIMCEN</name>
							<description>Simultaneous Conversion Packing Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable simultaneous mode conversion packing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable simultaneous mode conversion packing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INTLVEN</name>
							<description>Interleaved Conversion Packing Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable interleaved mode conversion packing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable interleaved mode conversion packing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCANEN</name>
							<description>Scan Mode Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable ADC scan mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable ADC scan mode. The ADC will scan through the defined time slots in sequence on every start of conversion.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCANMD</name>
							<description>Scan Mode Select. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONCE</name>
									<description>The channel sequencer will cycle through all of the specified time slots once.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOOP</name>
									<description>The channel sequencer will cycle through all of the specified time slots in a loop until SCANEN is cleared to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMA Interface Enable . </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the ADC module DMA interface.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the ADC module DMA interface.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCLKSEL</name>
							<description>Burst Mode Clock Select. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LPOSC0</name>
									<description>Burst mode uses the Low Power Oscillator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APB</name>
									<description>Burst mode uses the APB clock.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>SAR Clock Divider. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
						<field>
							<name>SCCIEN</name>
							<description>Single Conversion Complete Interrupt Enable. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the ADC single data conversion complete interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the ADC single data conversion complete interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SDIEN</name>
							<description>Scan Done Interrupt Enable. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the ADC scan complete interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the ADC scan complete interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FORIEN</name>
							<description>FIFO Overrun Interrupt Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the data FIFO overrun interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the data FIFO overrun interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FURIEN</name>
							<description>FIFO Underrun Interrupt Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the data FIFO underrun interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the data FIFO underrun interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
