cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x7_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>DEVICEID_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>DEVICEID_0</groupName>
			<baseAddress>0x400490c0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>DEVICEID0</name>
					<description>Device ID Word 0</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REVID</name>
							<description>Revision ID. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>REVA</name>
									<description>Revision A.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DEVICEID0</name>
							<description>Device ID 0. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>28</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEID1</name>
					<description>Device ID Word 1</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEVICEID1</name>
							<description>Device ID 1. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEID2</name>
					<description>Device ID Word 2</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEVICEID2</name>
							<description>Device ID 2. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEID3</name>
					<description>Device ID Word 3</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEVICEID3</name>
							<description>Device ID 3. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>EMIF_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>EMIF_0</groupName>
			<baseAddress>0x40026000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000010</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IF0EN</name>
							<description>Interface 0 Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable interface 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable interface 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IF1EN</name>
							<description>Interface 1 Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable interface 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable interface 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFFSTEN</name>
							<description>OFF Output State Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>EMIF will not enter the off state after 4 idle cycles.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>EMIF will enter the off state after 4 idle cycles.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>OFFSTS</name>
							<description>EMIF OFF Status. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ON</name>
									<description>The EMIF bus is active.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>The EMIF is in the off bus state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDLESTS</name>
							<description>EMIF IDLE Status. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_IDLE</name>
									<description>The EMIF has not been idle for four cycles.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDLE</name>
									<description>The EMIF has been idle for four four cycles.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<!--BASEPOINTER_START_2-->
				<register>
					<name>CONFIG_0</name>
					<description>Interface Configuration</description>
					<addressOffset>0x80</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BUSWIDTH</name>
							<description>Interface Bus Data Width. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The data bus is 8-bits wide.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16BIT</name>
									<description>The data bus is 16-bits wide.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MUXMD</name>
							<description>Interface Mux Mode. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONMUXED</name>
									<description>The interface operates in non-multiplexed mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MUXED</name>
									<description>The interface operates in multiplexed mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASEN</name>
							<description>Interface Automatic Address Shift Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The address is not automatically shifted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The address is automatically shifted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ROEN</name>
							<description>Interface Read Only Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The interface supports reads and writes.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The interface supports only reads.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDHINH</name>
							<description>Write Data Hold State Inhibit. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Enable the write data hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Inhibit the write data hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DELAYOE</name>
							<description>Output Enable Delay. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The output enable signal (/OE) is not delayed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The output enable signal (/OE) is delayed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>KLREN</name>
							<description>Keep Last Read Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The bus is driven to the idle state between active requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The bus drives the last value read on the interface between active requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IFRT_0</name>
					<description>Interface Read Timing</description>
					<addressOffset>0x90</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RASET</name>
							<description>Interface Read Address Setup Delay . </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>RAHOLD</name>
							<description>Interface Read Address Hold Delay. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>RDHOLD</name>
							<description>Interface Read Data Hold Delay. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>RDWAIT</name>
							<description>Interface Read Data Wait Delay. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IFWT_0</name>
					<description>Interface Write Timing</description>
					<addressOffset>0xa0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WASET</name>
							<description>Interface Write Address Setup Delay . </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>WAHOLD</name>
							<description>Interface Write Address Hold Delay. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>WDHOLD</name>
							<description>Interface Write Data Hold Delay. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>WDWAIT</name>
							<description>Interface Write Data Wait Delay. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
