cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x7_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>FLASHCTRL_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>FLASHCTRL_0</groupName>
			<baseAddress>0x4002e000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONFIG</name>
					<description>Controller Configuration</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000720</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SPMD</name>
							<description>Flash Speed Mode. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>Read and write the Flash at speed mode 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>Read and write the Flash at speed mode 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>Read and write the Flash at speed mode 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE3</name>
									<description>Read and write the Flash at speed mode 3.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDSEN</name>
							<description>Read Store Mode Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable read store mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable read store mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DPFEN</name>
							<description>Data Prefetch Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Data accesses are excluded from the prefetch buffer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Data accesses are included in the prefetch buffer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PFINH</name>
							<description>Prefetch Inhibit. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Any reads from Flash are prefetched until the prefetch buffer is full.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Inhibit the prefetch engine.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQWEN</name>
							<description>Flash Write Sequence Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable sequential write mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable sequential write mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERASEEN</name>
							<description>Flash Page Erase Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Writes to the WRDATA field will initiate a write to Flash at the address in the WRADDR field.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Writes to the WRDATA field will initiate an erase of the Flash page containing the address in the WRADDR field.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFSTS</name>
							<description>Flash Buffer Status. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>The Flash controller write data buffer is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>The Flash controller write data buffer is full.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSYF</name>
							<description>Flash Operation Busy Flag. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The Flash interface is not busy.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The Flash interface is busy with an operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WRADDR</name>
					<description>Flash Write Address</description>
					<addressOffset>0xa0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRADDR</name>
							<description>Flash Write Address. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>WRDATA</name>
					<description>Flash Write Data</description>
					<addressOffset>0xb0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRDATA</name>
							<description>Flash Write Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KEY</name>
					<description>Flash Modification Key</description>
					<addressOffset>0xc0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>KEY</name>
							<description>Flash Key. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MULTI_LOCK</name>
									<value>90</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INITIAL_UNLOCK</name>
									<value>165</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SINGLE_UNLOCK</name>
									<value>241</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MULTI_UNLOCK</name>
									<value>242</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TCONTROL</name>
					<description>Flash Timing Control</description>
					<addressOffset>0xd0</addressOffset>
					<resetValue>0x0003005C</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FLRTMD</name>
							<description>Flash Read Timing Mode. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SLOW</name>
									<description>Configure the Flash read controller for AHB clocks below 20 MHz.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Configure the Flash read controller for AHB clocks above 20 MHz.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
