cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x7_SVD.xml
				<register>
					<name>FLOWCN</name>
					<description>Flow Control</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00020001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RTS</name>
							<description>RTS State. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>RTS pin (before optional inversion) is driven low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>RTS pin (before optional inversion) is driven high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RX</name>
							<description>RX Pin Status. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>RX pin (after optional inversion) is low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>RX pin (after optional inversion) is high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTSINVEN</name>
							<description>RTS Invert Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The UART does not invert the RTS signal before driving the pin.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The UART inverts the RTS signal driving the pin.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTSTH</name>
							<description>RTS Threshold Control. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FULL</name>
									<description>RTS is de-asserted when the receive FIFO and shift register are full and no more incoming data can be stored.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE_BYTE_FREE</name>
									<description>RTS is de-asserted when the receive FIFO and shift register are nearly full and only one more data can be received.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTSEN</name>
							<description>RTS Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The RTS state is not changed by hardware. The RTS bit can be written only when hardware RTS is disabled (RTSEN = 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Hardware sets RTS when the receive FIFO is at or above the threshold set by RTSTH and clears RTS otherwise.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTS</name>
							<description>CTS State. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Indicates the CTS pin state (after optional inversion) is low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Indicates the CTS pin state (after optional inversion) is high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TX</name>
							<description>TX State. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>The TX pin (before optional inversion) is low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>The TX pin (before optional inversion) is high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTSINVEN</name>
							<description>CTS Invert Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The UART does not invert CTS.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The UART inverts CTS.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTSEN</name>
							<description>CTS Enable. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The CTS pin state does not affect transmissions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Transmissions will begin only if the CTS pin (after optional inversion) is low.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIRDAPW</name>
							<description>Transmit IrDA Pulse Width. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_16TH</name>
									<description>The IrDA pulse width is 1/16th of a bit period.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_8TH</name>
									<description>The IrDA pulse width is 1/8th of a bit period.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_16TH</name>
									<description>The IrDA pulse width is 3/16th of a bit period.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_4TH</name>
									<description>The IrDA pulse width is 1/4th of a bit period.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
